[{"data":1,"prerenderedAt":20},["Reactive",2],{"search-api":3},[4,11],{"id":5,"path":6,"dir":7,"title":8,"description":7,"keywords":9,"body":10},"content:0.index.md","/","","Home",[],"     Cisco Packet Tracer   Questa relazione ti spiegerà il procedimento di realizzazione di una rete fisica basata sui router cisco",{"id":12,"path":13,"dir":7,"title":14,"description":7,"keywords":15,"body":19},"content:1.Introduzione.md","/introduzione","Relazione esperienza pratica su router Cisco",[16,17,18],"Introduzione","Metodologia","Guida all'installazione di PuTTY","  Relazione esperienza pratica su router Cisco    Introduzione  Questa relazione descrive l'esperienza pratica svolta su router Cisco in un contesto di laboratorio didattico. L'obiettivo del laboratorio era acquisire familiarità con la configurazione e la gestione di router Cisco utilizzando Putty e la porta seriale.  Metodologia  La classe è stata divisa in 5 gruppi, ognuno dei quali ha lavorato su un router Cisco. I router erano collegati ai computer dei  studenti tramite un cavo console da USB. Per comunicare con il router, si è utilizzato il software Putty, che consente di emulare un terminale su una porta seriale.  Guida all'installazione di PuTTY  PuTTY è un software gratuito e open source che consente di emulare un terminale su una porta seriale. Può essere utilizzato per connettersi a router, switch e altri dispositivi di rete che utilizzano un'interfaccia a riga di comando.    Download  È possibile scaricare PuTTY dal sito ufficiale:   https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html  Installazione  Oppure è possibile installare PuTTY direttamente da riga di comando:  Windows  se si dispone già preinstallato Chocolatey (un package manager per windows), sarà possibile installare direttamente PuTTY con il seguente comando:   choco install putty\n  Linux  Se si utilizza un sistema basato su debian, basterà eseguire il seguente comdando:   sudo apt install putty\n  Configurazione  Accesso alla CLI tramite PuTTy con una connessione da console   Collegare lo switch al computer utilizzando un cavo seriale standard a 9 pin.   Il cavo console da Cisco DB9 a RJ45 supporta anche le connessioni da console, ma solo se lo switch ha una porta console RJ45. Una porta della console RJ45 è simile a una porta Ethernet ed è contrassegnata con CONSOLE sul pannello posteriore dello switch.     I notebook più recenti non dispongono di porte seriali, quindi in questo caso è necessario utilizzare un adattatore USB-seriale. Quando lo si collega a un computer, gli viene assegnato un numero di porta COM diverso da COM1. In questo caso, è necessario sapere dove trovare il numero di porta COM corretto quando si imposta la connessione con PuTTY. Fare clic con il pulsante destro del mouse sul logo Windows/menu Start e scegliere Gestione periferiche per aprirlo.    In Gestione periferiche, controllare la porta COM assegnata all'adattatore USB. In questo caso, per stabilire la connessione sarà necessario utilizzare COM4 per la linea seriale.     Passaggio 2. Aprire l'applicazione PuTTY. Viene visualizzata la finestra PuTTY Configuration (Configurazione PuTTY):  Passaggio 3. Sotto il campo Tipo di connessione, fare clic sul pulsante di opzione Seriale.  Passaggio 4. Inserire la porta COM sul campo Serial line e poi cliccare il pulsante open per aprire la connessione seriale.",1708558263317]