[{"data":1,"prerenderedAt":21},["Reactive",2],{"search-api":3},[4,11],{"id":5,"path":6,"dir":7,"title":8,"description":7,"keywords":9,"body":10},"content:0.index.md","/","","Home",[],"     Cisco Packet Tracer   Questa relazione ti spiegerà il procedimento di realizzazione di una rete fisica basata sui router cisco",{"id":12,"path":13,"dir":7,"title":14,"description":7,"keywords":15,"body":20},"content:1.Introduzione.md","/introduzione","Relazione esperienza pratica su router Cisco",[16,17,18,19],"Introduzione","Metodologia","Guida all'installazione di PuTTY","Command Line Interface","  Relazione esperienza pratica su router Cisco    Introduzione  Questa relazione descrive l'esperienza pratica svolta su router Cisco in un contesto di laboratorio didattico. L'obiettivo del laboratorio era acquisire familiarità con la configurazione e la gestione di router Cisco utilizzando Putty e la porta seriale.  Metodologia  La classe è stata divisa in 5 gruppi, ognuno dei quali ha lavorato su un router Cisco. I router erano collegati ai computer dei  studenti tramite un cavo console da USB. Per comunicare con il router, si è utilizzato il software Putty, che consente di emulare un terminale su una porta seriale.  Guida all'installazione di PuTTY  PuTTY è un software gratuito e open source che consente di emulare un terminale su una porta seriale. Può essere utilizzato per connettersi a router, switch e altri dispositivi di rete che utilizzano un'interfaccia a riga di comando.    Download  È possibile scaricare PuTTY dal sito ufficiale:   https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html  Installazione  Oppure è possibile installare PuTTY direttamente da riga di comando:  Windows  se si dispone già preinstallato Chocolatey (un package manager per windows), sarà possibile installare direttamente PuTTY con il seguente comando:     choco install putty\n  Linux  Se si utilizza un sistema basato su debian, basterà eseguire il seguente comdando:     sudo apt install putty\n  Configurazione  Accesso alla CLI tramite PuTTy con una connessione da console   Collegare lo switch al computer utilizzando un cavo seriale standard a 9 pin.   Il cavo console da Cisco DB9 a RJ45 supporta anche le connessioni da console, ma solo se lo switch ha una porta console RJ45. Una porta della console RJ45 è simile a una porta Ethernet ed è contrassegnata con CONSOLE sul pannello posteriore dello switch.     I notebook più recenti non dispongono di porte seriali, quindi in questo caso è necessario utilizzare un adattatore USB-seriale. Quando lo si collega a un computer, gli viene assegnato un numero di porta COM diverso da COM1. In questo caso, è necessario sapere dove trovare il numero di porta COM corretto quando si imposta la connessione con PuTTY. Fare clic con il pulsante destro del mouse sul logo Windows/menu Start e scegliere Gestione periferiche per aprirlo.    In Gestione periferiche, controllare la porta COM assegnata all'adattatore USB. In questo caso, per stabilire la connessione sarà necessario utilizzare COM4 per la linea seriale.   È possibile che non venga visualizzata nessuna porta COM, (come è accaduto a me), in tal caso sarà necessario installare i driver usb necessari per il funzionamento corretto.     Passaggio 2. Aprire l'applicazione PuTTY. Viene visualizzata la finestra PuTTY Configuration (Configurazione PuTTY):  Passaggio 3. Sotto il campo Tipo di connessione, fare clic sul pulsante di opzione Seriale.  Passaggio 4. Inserire la porta COM sul campo Serial line e poi cliccare il pulsante   open  per aprire la connessione seriale.  Command Line Interface  Prima di procedere con la configurazione del router, è consigliabile cancellare la configurazione di avvio precedente. Questo comando elimina tutte le impostazioni salvate sul router, riportandolo alle impostazioni di fabbrica.  Eseguire il comando   erase startup-config  con cautela. Assicurarsi di avere un backup completo della configurazione corrente, inclusa la configurazione di avvio e la configurazione in esecuzione. In caso di problemi, potrai ripristinare il router utilizzando il backup.  Per cancellare la configurazione di avvio precedente:  Accedere alla CLI del router.\nEseguire il comando configure terminal per entrare in modalità di configurazione.\nEseguire il comando   erase startup-config .\nConfermare l'eliminazione della configurazione di avvio.\nEseguire il comando write memory per salvare la modifica.\nUscire dalla CLI.\nDopo aver cancellato la configurazione di avvio, procedere con la configurazione del router come descritto di seguito.    Cambio hostname     enable\n   conf terminal\n    hostname vdf  - Imposta correttamente l'hostname del router a \"vdf (acronimo di ventresca, didyk, franceschini)\".  Interfaccia LAN (GigabitEthernet 0/1):    interface GigabitEthernet 0/1  - Seleziona l'interfaccia LAN.   ip address 192.168.4.1 255.255.255.0  - Assegna l'indirizzo IP 192.168.4.1/24 all'interfaccia LAN.   no shutdown  - Attiva l'interfaccia LAN.  Configurazione del DHCP    ip dhcp pool vdfPool  - Crea una pool DHCP chiamata \"vdfPool\".   default-router 192.168.4.1  - Imposta il gateway predefinito per i client DHCP al router stesso (192.168.4.1).   network 192.168.4.0 255.255.255.0  - Specifica l'intervallo di indirizzi IP da assegnare ai client DHCP.  Controllo del funzionamento del DHCP:  Per controllare se il DHCP funziona correttamente, è possibile utilizzare un computer esterno collegato al router tramite cavo RJ45:   Collegare il computer al router tramite una porta LAN libera.  Aprire un prompt dei comandi sul computer.  Eseguire il comando ipconfig per visualizzare le informazioni relative agli adattori di rete.  Verificare l'indirizzo IP assegnato al computer su   Ethernet adapter Ethernet: . Se l'indirizzo IP è all'interno dell'intervallo configurato per il pool DHCP (192.168.4.2 - 192.168.4.254), il DHCP funziona correttamente.  Interfaccia WAN (GigabitEthernet 0/0):    interface GigabitEthernet 0/0  - Seleziona l'interfaccia WAN.   ip address 10.0.0.10 255.255.255.252  - Assegna l'indirizzo IP 10.0.0.10/30 all'interfaccia WAN.   no shutdown  - Attiva l'interfaccia WAN.    Rotte statiche:     ip route 192.168.1.0 255.255.255.0 10.0.0.13\n   ip route 192.168.2.0 255.255.255.0 10.0.0.13\n   ip route 192.168.3.0 255.255.255.0 10.0.0.13\n   ip route 192.168.5.0 255.255.255.0 10.0.0.13\n   Si aggiungono le rotte statiche per raggiungere le altre reti tramite la porta 10.0.0.13 della rete WAN.  Spiegazione     192.168.2.0 = rete di destinazione\n   255.255.255.0 = subnet della rete di destinazione\n   10.10.10.2 = via, porta per qui deve passare, nexthop\n  Salvataggio:    copy run start  - Salva la configurazione corrente nella configurazione di avvio.  per verificare che la configurazione corrente sia stata salvata correttamente si utilizza il commando   show running config  Check Finale:  Il comando ping è uno strumento utile per verificare se le rotte configurate sul router funzionano correttamente. Invia un pacchetto di dati a un dispositivo specifico e attende una risposta. Se la risposta viene ricevuta, significa che la rotta verso il dispositivo è funzionante.    Procedura:   Aprire un prompt dei comandi sul computer.  Eseguire il comando   ping  seguito dall'indirizzo IP del dispositivo di destinazione. Ad esempio, per pingare il router stesso, si potrebbe utilizzare il comando   ping 192.168.4.1 .  Verificare l'output del comando. Se il ping ha successo, si vedranno delle righe che riportano informazioni come il tempo impiegato per inviare e ricevere il pacchetto, la dimensione del pacchetto e la TTL (Time to Live).  Esempio di output di ping di successo:     C:\\Users>ping 192.168.4.1\n   \n   Pinging 192.168.4.1 with 32 bytes of data:\n   \n   Reply from 192.168.4.1: bytes=32 time=1ms TTL=64\n   \n   Reply from 192.168.4.1: bytes=32 time=1ms TTL=64\n   \n   Reply from 192.168.4.1: bytes=32 time=1ms TTL=64\n   \n   Reply from 192.168.4.1: bytes=32 time=1ms TTL=64\n   \n   Ping statistics for 192.168.4.1:\n   \n   Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),\n   Approximate round trip times in milli-seconds:\n   Minimum = 1ms, Maximum = 1ms, Average = 1ms\n   Se il ping non ha successo, si potrebbero vedere dei messaggi di errore come:   \"Request timed out.\"  \"Destination host unreachable.\"  \"Ping request could not find host.\"   In caso di errori, è necessario:   Controllare la configurazione delle rotte sul router.  Assicurarsi che il dispositivo di destinazione sia acceso e connesso alla rete.  Verificare che non ci siano problemi di cablaggio o di connessione.    html .dark .shiki span {color: var(--shiki-dark);background: var(--shiki-dark-bg);font-style: var(--shiki-dark-font-style);font-weight: var(--shiki-dark-font-weight);text-decoration: var(--shiki-dark-text-decoration);}html.dark .shiki span {color: var(--shiki-dark);background: var(--shiki-dark-bg);font-style: var(--shiki-dark-font-style);font-weight: var(--shiki-dark-font-weight);text-decoration: var(--shiki-dark-text-decoration);}html .default .shiki span {color: var(--shiki-default);background: var(--shiki-default-bg);font-style: var(--shiki-default-font-style);font-weight: var(--shiki-default-font-weight);text-decoration: var(--shiki-default-text-decoration);}html .shiki span {color: var(--shiki-default);background: var(--shiki-default-bg);font-style: var(--shiki-default-font-style);font-weight: var(--shiki-default-font-weight);text-decoration: var(--shiki-default-text-decoration);}",1708646866382]